Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFH144.PIC
      <edc:SFRDef edc:_addr="0x1F8E1098" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBISMT1" edc:desc="" edc:impl="0x7ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----100001001000011000101001100" edc:name="EBISMT1" edc:nzwidth="32" edc:por="-----100001001000011000101001100" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRC" edc:desc="" edc:mask="0x3f" edc:name="TRC" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TAS" edc:desc="" edc:mask="0x3" edc:name="TAS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWR" edc:desc="" edc:mask="0x3" edc:name="TWR" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWP" edc:desc="" edc:mask="0x3f" edc:name="TWP" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TBTA" edc:desc="" edc:mask="0x7" edc:name="TBTA" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TPRC" edc:desc="" edc:mask="0xf" edc:name="TPRC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PAGEMODE" edc:desc="" edc:mask="0x1" edc:name="PAGEMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGESIZE" edc:desc="" edc:mask="0x3" edc:name="PAGESIZE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RDYMODE" edc:desc="" edc:mask="0x1" edc:name="RDYMODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E109C" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBISMT2" edc:desc="" edc:impl="0x7ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----100001001000011000101001100" edc:name="EBISMT2" edc:nzwidth="32" edc:por="-----100001001000011000101001100" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRC" edc:desc="" edc:mask="0x3f" edc:name="TRC" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TAS" edc:desc="" edc:mask="0x3" edc:name="TAS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWR" edc:desc="" edc:mask="0x3" edc:name="TWR" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWP" edc:desc="" edc:mask="0x3f" edc:name="TWP" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TBTA" edc:desc="" edc:mask="0x7" edc:name="TBTA" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TPRC" edc:desc="" edc:mask="0xf" edc:name="TPRC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PAGEMODE" edc:desc="" edc:mask="0x1" edc:name="PAGEMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGESIZE" edc:desc="" edc:mask="0x3" edc:name="PAGESIZE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RDYMODE" edc:desc="" edc:mask="0x1" edc:name="RDYMODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E10A0" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBIFTRPD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000001000000001" edc:name="EBIFTRPD" edc:nzwidth="32" edc:por="00000000000000000000001000000001" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRPD" edc:desc="" edc:mask="0xffffffff" edc:name="TRPD" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E10A4" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnn------n" edc:cname="EBISMCON" edc:desc="" edc:impl="0xff81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000100------1" edc:name="EBISMCON" edc:nzwidth="32" edc:por="----------------000000100------1" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SMRP" edc:desc="" edc:mask="0x1" edc:name="SMRP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SMDWIDTH0" edc:desc="" edc:mask="0x7" edc:name="SMDWIDTH0" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="SMDWIDTH1" edc:desc="" edc:mask="0x7" edc:name="SMDWIDTH1" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="SMDWIDTH2" edc:desc="" edc:mask="0x7" edc:name="SMDWIDTH2" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E10A8" edc:offset="3928"/>
      <edc:SFRDef edc:_addr="0x1F8E2000" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON1" edc:desc="SQI XIP Control Register 1" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u00000001011000000110000000000" edc:name="SQI1XCON1" edc:nzwidth="32" edc:por="--x00000001011000000110000000000" ltx:baseofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TYPECMD" edc:desc="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPECMD" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEADDR" edc:desc="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEADDR" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEMODE" edc:desc="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEMODE" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDUMMY" edc:desc="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" edc:mask="0x3" edc:name="TYPEDUMMY" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lange mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDATA" edc:desc="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEDATA" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="READOPCODE" edc:desc="These bits contain the 8-bit op code value for read operation." edc:mask="0xff" edc:name="READOPCODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="ADDRBYTES" edc:desc="" edc:mask="0x7" edc:name="ADDRBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Four address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Three address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DUMMYBYTES" edc:desc="Transmit Dummy Bytes bits" edc:mask="0x7" edc:name="DUMMYBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Transmit seven dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Transmit six dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Transmit five dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Transmit four dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Transmit three dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Transmit two dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Transmit one dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit zero dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRCMD" edc:desc="SQI DDR Command Mode bit" edc:mask="0x1" edc:name="DDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRADDR" edc:desc="SQI Address Mode bit" edc:mask="0x1" edc:name="DDRADDR" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRMODE" edc:desc="SQI DDR Mode bit" edc:mask="0x1" edc:name="DDRMODE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDUMMY" edc:desc="SQI Dummy DDR Mode bit" edc:mask="0x1" edc:name="DDRDUMMY" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDATA" edc:desc="SQI Data DDR Mode bit" edc:mask="0x1" edc:name="DDRDATA" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDRCMD" edc:desc="SQI Command in SDR Mode bit" edc:mask="0x1" edc:name="SDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command is in SDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command is in DDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
